Revit 2027 API
ParameterTypeId.IfcBuildingGuid Property
 "IfcBuilding GUID"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId IfcBuildingGuid { get; }
Public Shared ReadOnly Property IfcBuildingGuid As ForgeTypeId
	Get
public:
static property ForgeTypeId^ IfcBuildingGuid {
	ForgeTypeId^ get ();
}
static member IfcBuildingGuid : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace